TheDanEx/esp32-p4-eth_uros/examples/esp_p4_telemetry/ping_pong/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT=n

# micro-ROS: Ethernet with internal EMAC + IP101 PHY (Waveshare ESP32-P4-ETH)
CONFIG_MICRO_ROS_ESP_NETIF_ENET=y
CONFIG_MICRO_ROS_USE_INTERNAL_ETHERNET=y
CONFIG_MICRO_ROS_TRANSPORT_UDP=y
CONFIG_MICRO_ROS_ETH_PHY_IP101=y
CONFIG_MICRO_ROS_ETH_MDC_GPIO=31
CONFIG_MICRO_ROS_ETH_MDIO_GPIO=52
CONFIG_MICRO_ROS_ETH_PHY_RST_GPIO=51
CONFIG_MICRO_ROS_ETH_PHY_ADDR=1

# Ethernet Clock Configuration (Critical for ESP32-P4 RMII)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y
CONFIG_ETH_RMII_CLK_IN_GPIO=50

# Static IP (no DHCP available on the Pi 5 ethernet segment)
CONFIG_MICRO_ROS_ETH_STATIC_IP=y
CONFIG_MICRO_ROS_ETH_STATIC_IP_ADDR="192.168.5.2"
CONFIG_MICRO_ROS_ETH_STATIC_NETMASK="255.255.255.0"
CONFIG_MICRO_ROS_ETH_STATIC_GW="192.168.5.1"

# micro-ROS Agent running on Pi 5 (eth0 = 192.168.5.1)
CONFIG_MICRO_ROS_ESP_XRCE_DDS_MIDDLEWARE=y
CONFIG_MICRO_ROS_AGENT_IP="192.168.5.1"
CONFIG_MICRO_ROS_AGENT_PORT="8888"

# Hardware / Flashing fixes for Waveshare P4 (rev v1.3 / 16MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100
